Repository: lucamadd/TestMe
Catalog: lib/l10n/app_*.arb
Languages: it

# testme_master_version_info
source: version 0.4.0
it: versione 0.4.0

# add_row_main_title
source: Add Topic
it: Aggiungi argomento

# add_row_main_title2
source: Update Topic
it: Modifica argomento

# add_row_text_title_placeholder
source: Title
it: Titolo

# add_row_text_title_error
source: Please enter a topic title
it: Inserisci un titolo

# add_row_text_priority_placeholder
source: Priority
it: Priorità

# add_row_text_priority_error
source: Please select a priority level
it: Scegli un livello di priorità

# add_row_text_page_placeholder
source: Notes (optional)
it: Note (facoltativo)

# add_row_button_add
source: Add
it: Aggiungi

# add_row_button_update
source: Save
it: Salva

# add_row_button_delete
source: Delete
it: Elimina

# add_row_priorities_1
source: Low
it: Bassa

# add_row_priorities_2
source: Medium
it: Media

# add_row_priorities_3
source: High
it: Alta

# testme_screen_counter
source: {completed} of {total}
it: {completed} di {total}

# testme_screen_snackbar_text
source: Please add at least one topic!
it: Aggiungi almeno un argomento!

# testme_screen_no_topic_available
source: No topics available
it: Nessun argomento disponibile

# testme_screen_confirm_delete
source: All topics will be deleted.
it: Tutti gli argomenti verranno cancellati.

# testme_screen_confirm_delete_cancel
source: CANCEL
it: ANNULLA

# testme_screen_confirm_delete_confirm
source: CONFIRM
it: CONFERMA

# info_page_title
source: Settings
it: Impostazioni

# info_page_section1
source: Application
it: Applicazione

# info_page_section2
source: General
it: Generali

# info_page_setting1
source: Dark theme
it: Tema scuro

# info_page_setting2
source: Import from .txt file
it: Importa da file .txt

# info_page_setting2_5
source: Watch tutorial
it: Guarda tutorial

# info_page_setting3
source: Leave feedback
it: Lascia feedback

# info_page_toast_not_implemented
source: Coming soon!
it: Presto disponibile!

# info_page_about
source: TestMe is an open source application developed with Flutter. You can take a look at the source code at github.com/lucamadd/TestMe
it: TestMe è un'applicazione open source sviluppata con Flutter. Puoi dare un'occhiata al codice sorgente su github.com/lucamadd/TestMe

# info_page_about_support
source: Thank you for downloading TestMe! Ad banners support me, but if you want an ad-free experience you can simply use the app when you're offline. In addition to hiding the ads you'll maintain a higher level of concentration and have fewer distractions.
it: Grazie per aver scaricato TestMe! Le unità pubblicitarie presenti nell'app aiutano a supportarmi, ma se vuoi rimuoverle ti basta utilizzare l'app quando sei offline. In questo modo oltre a nascondere le pubblicità manterrai un livello di concentrazione più alto e avrai meno distrazioni.

# intro_page_one_title
source: Welcome to TestMe
it: Benvenuto in TestMe

# intro_page_one_body
source: TestMe is your personal assistant that helps you in exams and interviews. This short tutorial will help you understand how the app works.
it: TestMe è il tuo assistente personale per la preparazione di esami e interrogazioni. Questo breve tutorial ti guiderà nell'utilizzo dell'app.

# intro_page_two_body
source: You can create a list of topics. Every topic represent a question that could be asked during your exam.
it: In TestMe puoi creare una lista di argomenti. Ogni argomento corrisponde a una domanda che potrebbe essere posta all'esame.

# intro_page_two_body2
source: Once finished, TestMe will randomly choose a topic, then you can test your preparation.
it: Una volta aggiunta la lista di argomenti, TestMe ne estrarrà uno casualmente, e potrai verificare la tua preparazione su quell'argomento.

# intro_page_three_body
source: This is TestMe main page. On the upper side of the screen you can see the total number of topics.
it: Questa è la schermata principale dell'applicazione. Nella parte superiore dello schermo puoi visualizzare il numero totale di argomenti

# intro_page_three_body2
source: Press the "+" button to add a new topic.
it: Premi sul pulsante "+" per aggiungere un argomento.

# intro_page_four_body
source: Every topic has a priority level(high, medium, low). The higher the priority level, the more likely that topic will be chosen.
it: Quando aggiungi un argomento, puoi impostare un livello di priorità(alto, medio, basso). Un livello più alto di priorità indica una maggiore probabilità che quell'argomento venga scelto.

# intro_page_four_body2
source: You can also add a note, e.g. the page where the topic is at.
it: Eventualmente puoi aggiungere delle note, come ad esempio la pagina del libro in cui si trova quell'argomento.

# intro_page_five_body
source: Press the "TEST!" button to let TestMe choose a topic. Now it's your time. Is your preparation about this topic any good?
it: Premi sul pulsante "TEST!" in basso e verrà scelto un argomento. Ora sta a te decidere se il tuo livello di preparazione sull'argomento è soddisfacente.

# intro_page_six_body
source: TestMe will keep choosing topics until they are all marked. You can mark/unmark them anytime.
it: TestMe estrarrà gli argomenti fino a quando non saranno tutti contrassegnati. Ovviamente in ogni momento puoi decidere se contrassegnarli o meno come già affrontati.

# intro_page_six_body2
source: That's all. Good luck!
it: Questo è tutto. Buona fortuna!

# intro_page_skip
source: Skip
it: Salta

# intro_page_done
source: Done
it: Fatto
